#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/fiap-postech-tsombra/order-api/runs/run-xXQH1JNFZTtfR24d

Waiting for the plan to start...

Terraform v1.9.1
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloud_run_v2_service.fiap-postech will be created
  + resource "google_cloud_run_v2_service" "fiap-postech" {
      + client                  = "terraform"
      + conditions              = (known after apply)
      + etag                    = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "us-central1"
      + name                    = "order-api"
      + observed_generation     = (known after apply)
      + project                 = (known after apply)
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + uri                     = (known after apply)

      + template {
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = (known after apply)
          + timeout                          = (known after apply)

          + containers {
              + image = "southamerica-east1-docker.pkg.dev/fiap-pos-tech-428300/fiap/order-api:b1066b35fb6c250e0b28e2ec5395ade507956bf4"

              + env {
                  + name  = "DATABASE_URL"
                  + value = "mysql://user:user@localhost/fast-food-db?socket=/cloudsql/lateral-scion-414400:southamerica-east1:order-database"
                }

              + ports (known after apply)

              + resources (known after apply)

              + startup_probe (known after apply)

              + volume_mounts {
                  + mount_path = "/cloudsql"
                  + name       = "cloudsql"
                }
            }

          + scaling (known after apply)

          + volumes {
              + name = "cloudsql"

              + cloud_sql_instance {
                  + instances = [
                      + "lateral-scion-414400:southamerica-east1:order-database",
                    ]
                }
            }
        }

      + traffic (known after apply)
    }

  # google_project_service.cloudrun_api will be created
  + resource "google_project_service" "cloudrun_api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "run.googleapis.com"
    }

  # google_project_service.secretmanager_api will be created
  + resource "google_project_service" "secretmanager_api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "secretmanager.googleapis.com"
    }

  # google_project_service.sqladmin_api will be created
  + resource "google_project_service" "sqladmin_api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "sqladmin.googleapis.com"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @tshadz, Action: `pull_request`*